Results/Kubernetes/17-01-22/Cluster1/14/k8s-sn-wrk-mixed-c6525-25g-exp14-havail0-hori0-verti1-infi1-t4-c512-d30-R4000
No argument supplied nginx
using  args: threads=4 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://localhost:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 15.524ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.520ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 23.950ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 91.991ms, rate sampling interval: 736ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    54.17ms  169.64ms 938.49ms   92.60%
    Req/Sec     1.06k   331.37     1.89k    66.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.42ms
 75.000%    5.01ms
 90.000%  148.10ms
 99.000%  938.49ms
 99.900%    1.47s 
 99.990%    1.86s 
 99.999%    2.09s 
100.000%    2.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.013     0.000000            1         1.00
       1.405     0.100000         8003         1.11
       1.580     0.200000        15974         1.25
       1.856     0.300000        23951         1.43
       2.137     0.400000        31960         1.67
       2.417     0.500000        39903         2.00
       2.601     0.550000        43899         2.22
       2.903     0.600000        47875         2.50
       3.653     0.650000        51862         2.86
       4.483     0.700000        55861         3.33
       5.007     0.750000        59849         4.00
       5.339     0.775000        61839         4.44
       6.323     0.800000        63830         5.00
      26.095     0.825000        65822         5.71
      57.855     0.850000        67818         6.67
      95.935     0.875000        69811         8.00
     120.831     0.887500        70809         8.89
     148.095     0.900000        71811        10.00
     180.607     0.912500        72805        11.43
     220.543     0.925000        73803        13.33
     270.847     0.937500        74798        16.00
     303.871     0.943750        75297        17.78
     340.735     0.950000        75795        20.00
     384.767     0.956250        76297        22.86
     442.367     0.962500        76793        26.67
     511.999     0.968750        77294        32.00
     559.103     0.971875        77541        35.56
     601.599     0.975000        77791        40.00
     651.775     0.978125        78042        45.71
     715.263     0.981250        78290        53.33
     784.383     0.984375        78538        64.00
     824.319     0.985938        78663        71.11
     866.815     0.987500        78790        80.00
     909.311     0.989062        78912        91.43
     960.511     0.990625        79037       106.67
    1014.783     0.992188        79161       128.00
    1044.991     0.992969        79224       142.22
    1076.223     0.993750        79286       160.00
    1110.015     0.994531        79349       182.86
    1155.071     0.995313        79411       213.33
    1193.983     0.996094        79473       256.00
    1221.631     0.996484        79504       284.44
    1248.255     0.996875        79535       320.00
    1281.023     0.997266        79569       365.71
    1306.623     0.997656        79598       426.67
    1345.535     0.998047        79631       512.00
    1361.919     0.998242        79646       568.89
    1383.423     0.998437        79660       640.00
    1405.951     0.998633        79675       731.43
    1436.671     0.998828        79694       853.33
    1479.679     0.999023        79707      1024.00
    1501.183     0.999121        79714      1137.78
    1527.807     0.999219        79722      1280.00
    1545.215     0.999316        79730      1462.86
    1611.775     0.999414        79738      1706.67
    1637.375     0.999512        79746      2048.00
    1654.783     0.999561        79750      2275.56
    1676.287     0.999609        79753      2560.00
    1698.815     0.999658        79757      2925.71
    1722.367     0.999707        79761      3413.33
    1737.727     0.999756        79765      4096.00
    1760.255     0.999780        79767      4551.11
    1772.543     0.999805        79769      5120.00
    1787.903     0.999829        79771      5851.43
    1817.599     0.999854        79773      6826.67
    1840.127     0.999878        79775      8192.00
    1859.583     0.999890        79776      9102.22
    1889.279     0.999902        79777     10240.00
    1916.927     0.999915        79778     11702.86
    1948.671     0.999927        79779     13653.33
    1966.079     0.999939        79780     16384.00
    1966.079     0.999945        79780     18204.44
    2007.039     0.999951        79781     20480.00
    2007.039     0.999957        79781     23405.71
    2062.335     0.999963        79782     27306.67
    2062.335     0.999969        79782     32768.00
    2062.335     0.999973        79782     36408.89
    2085.887     0.999976        79783     40960.00
    2085.887     0.999979        79783     46811.43
    2085.887     0.999982        79783     54613.33
    2085.887     0.999985        79783     65536.00
    2085.887     0.999986        79783     72817.78
    2199.551     0.999988        79784     81920.00
    2199.551     1.000000        79784          inf
#[Mean    =       54.168, StdDeviation   =      169.643]
#[Max     =     2197.504, Total count    =        79784]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  117778 requests in 30.00s, 267.54MB read
  Non-2xx or 3xx responses: 6755
Requests/sec:   3925.76
Transfer/sec:      8.92MB